//********************************************************************
//
//      KEY Init Initialization Part
//      4DClass
//      Copyright(C)  2017
//      All rights reserved
//***********************************************************************
#include "Myinclude.h"

/*******************************************************************************
 * 函数名：Timer00_Init
 * 描述  ：系定时器2初始化函数
 * 输入  ：无
 * 输出  ：无
 * 调用  ：内部调用
 ******************************************************************************/
void Timer0_Init(void)
{
    //OPTION
    T0CS=0;	//0=定时器，1=计数器
    PSA=0;	//预分频选择0=TIMER0，1=WDT
    PS0=0;
    PS1=1;
    PS2=1;//预分频位选择 1:16

    TMR0=10;//付初值

    //INTCON
    PEIE=1;//外设中断使能 1=enble 0=disable
    T0IE=1;//定时器0溢出中断使能 1=enable 0=disable
    T0IF=0;//定时器0溢出中断标志位 硬件置1，软件清0
    GIE=1;//全局中断使能 1=enble 0=disable
}



